In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [3]:
Series

pandas.core.series.Series

In [4]:
# list vs Series

In [5]:
nums = [300, 200, 100]
nums

[300, 200, 100]

In [6]:
s = Series(nums)
s

0    300
1    200
2    100
dtype: int64

In [7]:
list(s)

[300, 200, 100]

In [8]:
# dict vs. Series

In [9]:
d = {"one": 1, "two": 2, "three": 3}
d

{'one': 1, 'two': 2, 'three': 3}

In [10]:
s = Series(d)
s

one      1
two      2
three    3
dtype: int64

In [11]:
s["two"]

2

In [12]:
s[1:]

two      2
three    3
dtype: int64

In [13]:
Series({0:99, 1:88, 2:77})

0    99
1    88
2    77
dtype: int64

In [14]:
s = Series([99,88,77]) # very similar to above
s

0    99
1    88
2    77
dtype: int64

In [15]:
# this fails:
# s[-1]

In [16]:
s = Series({-1:55, 0:99, 1:88, 2:77})
s

-1    55
 0    99
 1    88
 2    77
dtype: int64

In [17]:
s[-1], s[1]

(55, 88)

In [18]:
# this fails:
# s[55]

In [19]:
nums = Series([100,200,300])
nums

0    100
1    200
2    300
dtype: int64

In [20]:
nums + 1

0    101
1    201
2    301
dtype: int64

In [21]:
shorter = Series([5, 6])
nums + shorter

0    105.0
1    206.0
2      NaN
dtype: float64

In [22]:
list(nums) + list(shorter)

[100, 200, 300, 5, 6]

In [23]:
shorter

0    5
1    6
dtype: int64

In [24]:
shorter * shorter

0    25
1    36
dtype: int64

In [25]:
s1 = Series([3,4,5])
s2 = Series([5,4,3])

In [26]:
s1

0    3
1    4
2    5
dtype: int64

In [27]:
s2

0    5
1    4
2    3
dtype: int64

In [28]:
s1 > s2

0    False
1    False
2     True
dtype: bool

In [29]:
s1 == s2

0    False
1     True
2    False
dtype: bool

In [30]:
s1 = Series([False, False, True])
s2 = Series([False, True, True])

In [31]:
s1 | s2 # | is the same as or

0    False
1     True
2     True
dtype: bool

In [32]:
s1 & s2 # & is the same as and

0    False
1    False
2     True
dtype: bool

In [33]:
# data alignment

In [34]:
s1 = Series([100, 200, 300])
s1

0    100
1    200
2    300
dtype: int64

In [35]:
s2 = Series([11, 22, 33], index=[3,2,1])
s2

3    11
2    22
1    33
dtype: int64

In [36]:
s1 + s2

0      NaN
1    233.0
2    322.0
3      NaN
dtype: float64

In [37]:
# fancy indexing

# obj[X]
#
# what can X be?
# 1. index (int)
# 2. key (a lot of things)
# 3. Series (Series[Series])    <-- this is fancy indexing

In [38]:
s = Series(["A", "B", "C", "D"])
s

0    A
1    B
2    C
3    D
dtype: object

In [39]:
b1 = Series({0:True, 1:False, 2:False, 3:True})
b2 = Series([True, False, False, True])
b2

0     True
1    False
2    False
3     True
dtype: bool

In [40]:
s[b1]

0    A
3    D
dtype: object

In [41]:
s[b2]

0    A
3    D
dtype: object

In [42]:
# combine element-wise bool ops with fancy indexing

In [43]:
s = Series([1, 99, 50, 40, 45, 20])
s

0     1
1    99
2    50
3    40
4    45
5    20
dtype: int64

In [44]:
b = s < 25
b

0     True
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [45]:
s[b]

0     1
5    20
dtype: int64

In [46]:
s[s < 25]

0     1
5    20
dtype: int64

In [47]:
s[s > 40]

1    99
2    50
4    45
dtype: int64

In [48]:
list(s[s > 40])

[99, 50, 45]

In [49]:
Series(list(s[s > 40]))

0    99
1    50
2    45
dtype: int64

In [50]:
s = Series([1, 99, 50, 40, 45, 20])
s

0     1
1    99
2    50
3    40
4    45
5    20
dtype: int64

In [51]:
# want all the odd numbers
s[s % 2 == 1]

0     1
1    99
4    45
dtype: int64

In [52]:
# want odd numbers greater than 10
s % 2 == 1

0     True
1     True
2    False
3    False
4     True
5    False
dtype: bool

In [53]:
s > 10

0    False
1     True
2     True
3     True
4     True
5     True
dtype: bool

In [54]:
s[(s % 2 == 1) & (s > 10)]

1    99
4    45
dtype: int64

In [55]:
s = Series(["dog", "CAT", "apple", "BANANA"])
s

0       dog
1       CAT
2     apple
3    BANANA
dtype: object

In [56]:
s.str.upper()

0       DOG
1       CAT
2     APPLE
3    BANANA
dtype: object

In [57]:
s == s.str.upper()

0    False
1     True
2    False
3     True
dtype: bool

In [58]:
s[s == s.str.upper()]

1       CAT
3    BANANA
dtype: object

In [59]:
s = Series(["dog", "apple"])
s[s == s.str.upper()]

Series([], dtype: object)

In [64]:
# DataFrames = Tables

In [65]:
names = Series(["Alice", "Bob", "Cindy"])
scores = Series([10, 20, 30])

In [66]:
names

0    Alice
1      Bob
2    Cindy
dtype: object

In [67]:
scores

0    10
1    20
2    30
dtype: int64

In [68]:
DataFrame({"name":names, "score":scores})

    name  score
0  Alice     10
1    Bob     20
2  Cindy     30

In [78]:
df = DataFrame({"name": ["Alice", "Bob", "Cindy"],
                "score":[10, 20, 30],
                "where": [0,0,0]})

In [79]:
df

    name  score  where
0  Alice     10      0
1    Bob     20      0
2  Cindy     30      0

In [72]:
df["score"]

0    10
1    20
2    30
Name: score, dtype: int64

In [73]:
df["name"]

0    Alice
1      Bob
2    Cindy
Name: name, dtype: object

In [75]:
df.score # shorthand for df["score"]

0    10
1    20
2    30
Name: score, dtype: int64

In [81]:
df["where"]

0    0
1    0
2    0
Name: where, dtype: int64

In [82]:
df

    name  score  where
0  Alice     10      0
1    Bob     20      0
2  Cindy     30      0

In [83]:
df.loc[2]

name     Cindy
score       30
where        0
Name: 2, dtype: object

In [84]:
df.loc[1]

name     Bob
score     20
where      0
Name: 1, dtype: object

In [85]:
df.iloc[1]

name     Bob
score     20
where      0
Name: 1, dtype: object

In [88]:
df

    name  score  where
0  Alice     10      0
1    Bob     20      0
2  Cindy     30      0

In [90]:
new_df = df.set_index("name")
new_df

       score  where
name
Alice     10      0
Bob       20      0
Cindy     30      0

In [92]:
new_df.loc["Cindy"]

score    30
where     0
Name: Cindy, dtype: int64

In [93]:
new_df.iloc[2]

score    30
where     0
Name: Cindy, dtype: int64

In [94]:
new_df.iloc[-1]

score    30
where     0
Name: Cindy, dtype: int64

In [95]:
new_df

       score  where
name
Alice     10      0
Bob       20      0
Cindy     30      0

In [97]:
new_df.loc["Bob", "score"]

20

In [98]:
new_df.loc["Bob", "score"] = 21

In [99]:
new_df

       score  where
name
Alice     10      0
Bob       21      0
Cindy     30      0

In [100]:
df

    name  score  where
0  Alice     10      0
1    Bob     20      0
2  Cindy     30      0

In [101]:
new_df

       score  where
name
Alice     10      0
Bob       21      0
Cindy     30      0

In [102]:
new_df

       score  where
name
Alice     10      0
Bob       21      0
Cindy     30      0

In [104]:
new_df.iloc[2, 0] = 31

In [105]:
new_df

       score  where
name
Alice     10      0
Bob       21      0
Cindy     31      0

In [106]:
# ways to create a DataFrame

In [107]:
df = DataFrame({"name": ["Alice", "Bob", "Cindy"],
                "score":[10, 20, 30],
                "where": [0,0,0]})

In [109]:
df = pd.read_csv("Fifa18.csv")

In [111]:
df.head()

,Id,name,Age,nationality,club,league,euro_wage,networth,score_of_100
0,20801,Cristiano Ronaldo,32,Portugal,Real Madrid CF,Spanish Primera División,565000,95500000,94
1,158023,L. Messi,30,Argentina,FC Barcelona,Spanish Primera División,565000,105000000,93
2,190871,Neymar,25,Brazil,Paris Saint-Germain,French Ligue 1,280000,123000000,92
3,176580,L. Suárez,30,Uruguay,FC Barcelona,Spanish Primera División,510000,97000000,92
4,167495,M. Neuer,31,Germany,FC Bayern Munich,German Bundesliga,230000,61000000,92

In [115]:
df["euro_wage"].max()

565000

In [116]:
df["Age"].max()

47

In [ ]:
# Fancy Indexing
# 1. Series[BoolSeries]
# 2. DataFrame[BoolSeries]

In [118]:
df[df["Age"] == df["Age"].max()]

,Id,name,Age,nationality,club,league,euro_wage,networth,score_of_100
17465,11728,B. Richardson,47,England,Wycombe Wanderers,English League Two,1000,0,46

In [119]:
df[df["Age"] >= 40]

,Id,name,Age,nationality,club,league,euro_wage,networth,score_of_100
1322,137854,M. Storari,40,Italy,Milan,Italian Serie A,38000,525000,76
2126,3665,B. Nivet,40,France,ES Troyes AC,French Ligue 1,16000,0,74
3022,17605,T. Simons,40,Belgium,Club Brugge KV,Belgian First Division A,14000,0,73
3182,176900,M. Candelo,40,Colombia,Asociacion Deportivo Cali,Colombian Primera A,2000,0,72
4685,140029,O. Pérez,44,Mexico,Pachuca,Mexican Liga MX,9000,160000,71
5149,188033,E. El Hadary,44,Egypt,Al Taawoun,Saudi Professional League,7000,120000,70
6458,20731,Quim,41,Portugal,CD Aves,Portuguese Primeira Liga,3000,70000,69
7505,148745,K. Wæhler,41,Norway,Sogndal,Norwegian Eliteserien,2000,0,67
15719,591,C. Day,41,England,Stevenage,English League Two,1000,10000,57
16276,53506,D. Coyne,43,Wales,Shrewsbury,English League One,1000,10000,55
16399,53643,J. Walker,43,England,Lincoln City,English League Two,1000,10000,55
17465,11728,B. Richardson,47,England,Wycombe Wanderers,English League Two,1000,0,46

In [123]:
stats = df.describe()
stats

                  Id           Age      euro_wage      networth  score_of_100
count   17469.000000  17469.000000   17469.000000  1.746900e+04  17469.000000
mean   207584.098460     25.133265   11696.433683  2.407283e+06     66.271395
std     32339.098668      4.597354   23249.349262  5.391004e+06      6.931154
min        16.000000     16.000000    1000.000000  0.000000e+00     46.000000
25%    192567.000000     21.000000    2000.000000  3.250000e+05     62.000000
50%    214016.000000     25.000000    4000.000000  7.000000e+05     66.000000
75%    231383.000000     28.000000   12000.000000  2.100000e+06     71.000000
max    241219.000000     47.000000  565000.000000  1.230000e+08     94.000000

In [126]:
stddev = stats.loc["std", "euro_wage"]
stddev

23249.349262210257

In [129]:
df[df.euro_wage > df.euro_wage.mean() + 5*stddev]

,Id,name,Age,nationality,club,league,euro_wage,networth,score_of_100
0,20801,Cristiano Ronaldo,32,Portugal,Real Madrid CF,Spanish Primera División,565000,95500000,94
1,158023,L. Messi,30,Argentina,FC Barcelona,Spanish Primera División,565000,105000000,93
2,190871,Neymar,25,Brazil,Paris Saint-Germain,French Ligue 1,280000,123000000,92
3,176580,L. Suárez,30,Uruguay,FC Barcelona,Spanish Primera División,510000,97000000,92
4,167495,M. Neuer,31,Germany,FC Bayern Munich,German Bundesliga,230000,61000000,92
5,188545,R. Lewandowski,28,Poland,FC Bayern Munich,German Bundesliga,355000,92000000,91
6,193080,De Gea,26,Spain,Manchester United,English Premier League,215000,64500000,90
7,183277,E. Hazard,26,Belgium,Chelsea,English Premier League,295000,90500000,90
8,182521,T. Kroos,27,Germany,Real Madrid CF,Spanish Primera División,340000,79000000,90
9,167664,G. Higuaín,29,Argentina,Juventus,Italian Serie A,275000,77000000,90
10,155862,Sergio Ramos,31,Spain,Real Madrid CF,Spanish Primera División,310000,52000000,90
11,192985,K. De Bruyne,26,Belgium,Manchester City,English Premier League,285000,83000000,89
12,192119,T. Courtois,25,Belgium,Chelsea,English Premier League,190000,59000000,89
13,184941,A. Sánchez,28,Chile,Arsenal,English Premier League,265000,67500000,89
14,177003,L. Modrić,31,Croatia,Real Madrid CF,Spanish Primera División,340000,57000000,89
15,173731,G. Bale,27,Wales,Real Madrid CF,Spanish Primera División,370000,69500000,89
16,153079,S. Agüero,29,Argentina,Manchester City,English Premier League,325000,66500000,89
17,138956,G. Chiellini,32,Italy,Juventus,Italian Serie A,225000,38000000,89
19,211110,P. Dybala,23,Argentina,Juventus,Italian Serie A,215000,79000000,88
21,194765,A. Griezmann,26,France,Atlético Madrid,Spanish Primera División,150000,75000000,88
22,189509,Thiago,26,Spain,FC Bayern Munich,German Bundesliga,225000,70500000,88
23,188567,P. Aubameyang,28,Gabon,Borussia Dortmund,German Bundesliga,165000,61000000,88
24,184344,L. Bonucci,30,Italy,Milan,Italian Serie A,210000,44000000,88
25,183907,J. Boateng,28,Germany,FC Bayern Munich,German Bundesliga,215000,48000000,88
27,178603,M. Hummels,28,Germany,FC Bayern Munich,German Bundesliga,215000,48000000,88
28,176635,M. Özil,28,Germany,Arsenal,English Premier League,265000,60000000,88
29,167948,H. Lloris,30,France,Tottenham Hotspur,English Premier League,165000,38000000,88
30,164240,Thiago Silva,32,Brazil,Paris Saint-Germain,French Ligue 1,175000,34000000,88
31,41236,Z. Ibrahimović,35,Sweden,Manchester United,English Premier League,240000,27000000,88
32,9014,A. Robben,33,Netherlands,FC Bayern Munich,German Bundesliga,225000,36000000,88
...,...,...,...,...,...,...,...,...,...
168,181783,M. Mandžukić,31,Croatia,Juventus,Italian Serie A,135000,23500000,83
169,180819,A. Lallana,29,England,Liverpool,English Premier League,135000,25000000,83
179,167905,A. Valencia,31,Ecuador,Manchester United,English Premier League,130000,17000000,83
187,146562,Santi Cazorla,32,Spain,Arsenal,English Premier League,130000,19500000,83
188,142754,J. Mascherano,33,Argentina,FC Barcelona,Spanish Primera División,155000,10500000,83
194,20289,Y. Touré,34,Ivory Coast,Manchester City,English Premier League,145000,12500000,83
207,211575,André Gomes,23,Portugal,FC Barcelona,Spanish Primera División,150000,30000000,82
211,208618,Lucas Vázquez,26,Spain,Real Madrid CF,Spanish Primera División,185000,26000000,82
216,207410,M. Kovačić,23,Croatia,Real Madrid CF,Spanish Primera División,150000,30000000,82
227,202652,R. Sterling,22,England,Manchester City,English Premier League,140000,29500000,82
229,202477,Deulofeu,23,Spain,FC Barcelona,Spanish Primera División,165000,31000000,82
231,201862,M. Rojo,27,Argentina,Manchester United,English Premier League,130000,21000000,82
243,193082,J. Cuadrado,29,Colombia,Juventus,Italian Serie A,130000,21500000,82
254,186561,A. Ramsey,26,Wales,Arsenal,English Premier League,130000,25500000,82
256,184484,G. Sigurðsson,27,Iceland,Everton,English Premier League,130000,23000000,82
265,181291,G. Wijnaldum,26,Netherlands,Liverpool,English Premier League,130000,27000000,82
267,178509,O. Giroud,30,France,Arsenal,English Premier League,140000,21500000,82
269,178224,J. Hernández,29,Mexico,West Ham United,English Premier League,135000,22000000,82
275,171833,D. Sturridge,27,England,Liverpool,English Premier League,140000,23500000,82
291,143745,A. Turan,30,Turkey,FC Barcelona,Spanish Primera División,170000,20500000,82
292,135507,Fernandinho,32,Brazil,Manchester City,English Premier League,130000,12500000,82
322,201400,Rafinha,24,Brazil,FC Barcelona,Spanish Primera División,140000,23500000,81
323,200724,Nacho Fernández,27,Spain,Real Madrid CF,Spanish Primera División,145000,17500000,81
325,199564,Sergi Roberto,25,Spain,FC Barcelona,Spanish Primera División,140000,19500000,81
327,199354,Lucas Pérez,28,Spain,RC Deportivo de La Coruña,Spanish Primera División,135000,18500000,81
355,187961,Paulinho,28,Brazil,FC Barcelona,Spanish Primera División,165000,17500000,81
413,205192,Denis Suárez,23,Spain,FC Barcelona,Spanish Primera División,140000,20500000,80
455,186146,D. Welbeck,26,England,Arsenal,English Premier League,130000,17500000,80
582,200454,Paco Alcácer,23,Spain,FC Barcelona,Spanish Primera División,150000,17500000,79
640,176944,M. Fellaini,29,Belgium,Manchester United,English Premier League,140000,12000000,79